GHB2/src/Documents/гхб_ЛимитНаМобильнуюСвязь/гхб_ЛимитНаМобильнуюСвязь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЛимитНаМобильнуюСвязь</name>
  <registerRecords>InformationRegister.гхб_СоответствиеНомеровТелефоновДопУслугам</registerRecords>
  <registerRecords>InformationRegister.гхб_СоответствиеНомеровТелефоновФизЛицам</registerRecords>
  <attributes>
    <name>БазаХолдинга</name>
    <type>
      <types>CatalogRef.гхб_БазыХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.гхб_ОрганизацииБазХолдинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИДИзБазыХолдинга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененНоНеМигрировал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Лимиты</name>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>CatalogRef.гхб_НомераТелефонов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицоБазыХолдинга</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛимитВнутренний</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛимитМеждународнойСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>EnumRef.гхб_ИспользованиеНомеровТелефонов</types>
      </type>
    </attributes>
    <attributes>
      <name>БезлимитныйВнутренний</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БезлимитнаяМеждународнаяСвязь</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦеновойПакет</name>
      <type>
        <types>CatalogRef.гхб_ЦеновыеПакетыМобильнойСвязи</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйБазыХолдинга</name>
      <type>
        <types>CatalogRef.гхб_ФизическиеЛицаБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУстройства</name>
      <type>
        <types>EnumRef.гхб_ТипыУстройствМобильнойСвязи</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛицевогоСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.гхб_ДолжностиОрганизацийБазХолдинга</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.гхб_ЦФО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеУслуги</name>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>CatalogRef.гхб_НомераТелефонов</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <comment>Услуга</comment>
      <type>
        <types>CatalogRef.гхб_ДополнительныеУслугиДляНомеровТелефонов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GHB2/src/Documents/гхб_ЛимитНаМобильнуюСвязь/Forms/ФормаВыбораДопУслуг/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МассивДопУслуг") Тогда
		
		НомерТелефона = Параметры.НомерТелефона;
		
		Для каждого ЭлементУслуга Из Параметры.МассивДопУслуг Цикл
		 
			НовСтр = ТаблицаДопУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ЭлементУслуга);
		 
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаУслугаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаДопУслуг.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекДанные.Сумма = ВернутьСуммуПоУслуге(ТекДанные.Услуга);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура Ок(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("НомерТелефона", НомерТелефона);
	ПараметрыЗакрытия.Вставить("ТаблицаДопУслуг", ТаблицаДопУслуг);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ВернутьСуммуПоУслуге(Услуга)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Услуга, "Сумма");
КонецФункции

#КонецОбласти
